import { map } from "lodash-es";

// 定义mapData数据结构，用来表示地图上每一个数据点
export interface MapdataType {
    name: string;   // 地区名称
    value: [number, number, number];  //x,y,value [经度，纬度，数据值]
}

export interface ClimateDataItem {
    name: string;
    value: number;
    climate: string;
}

interface RegionConfig {
  center: number[];
  zoom: number;
}

// 个别定义不同片区的中心点经纬度和缩放比例
export const climateRegionConfigs: { [key: string]: RegionConfig} = {
  "热带雨林片区": {
    center: [129.046781, 21.473854],    
    zoom: 6.4
  },
  "温带季风片区": {
    center: [121.243362, 42.008425],  
    zoom: 2.1
  },
  "温带大陆性片区": {
    center: [100.522513, 41.173573],   
    zoom: 1.4
  },
  "高原山地片区": {
    center: [90.671510, 32.714196],    
    zoom: 3.0
  },
  "亚热带季风片区": {
    center: [110.024828, 28.224250],    
    zoom: 3.0
  },
  "热带季风片区": {
    center: [107.469340, 23.454607],    
    zoom: 3.7
  }
};

// 固定输入可能性，否则会有风险报错
type ClimateRegionKey =
  | "热带雨林片区"
  | "温带季风片区"
  | "温带大陆性片区"
  | "高原山地片区"
  | "亚热带季风片区"
  | "热带季风片区";

// 生成ECharts地图配置项（option），根据传入的区域代码、业务数据和地图数据来构造一个完整的地图图表配置
export const optionHandle = (regionCode: string,
    list: ClimateDataItem[],
    mapData: MapdataType[]) => {
    let top = 40;   // 中国地图偏移高度
    let left = 30;
    let zoom = ["china"].includes(regionCode) ? 1.20 : 1;   // china就放大地图否则正常比例
    let region = list[0].climate;
    let config = climateRegionConfigs[region];
    return {
        backgroundColor: "rgba(255, 255, 255, 0)",
        tooltip: {
            show: false,
        },
        legend: {
            show: false,
        },
        visualMap: {
            seriesIndex:0,  // 如下视觉映射只影响series0，地图数据第一层
            // 左下角的图例设计
            left: 15,
            show: false,  // 不显示图例
            bottom: 18,
            pieces: [
                { value: 0, label: "热带雨林片区" },
                { value: 1, label: "温带季风片区" },
                { value: 2, label: "温带大陆性片区" }, 
                { value: 3, label: "高原山地片区" }, 
                { value: 4, label: "亚热带季风片区" },
                { value: 5, label: "热带季风片区" },
            ],
            inRange: {
                // 图例的渐变颜色，从小到大
                color: [
                    // 暖色系
                    "rgba(255, 214, 165, 0.9)",  // 浅橙黄
                    "rgba(255,180,120,0.9)",  // 浅橙
                    "rgba(255,140,70,0.9)",   // 橙
                    "rgba(255,99,71,0.9)",    // 番茄红
                    "rgba(230,58,48,0.9)",    // 深红橙
                    "rgba(170,22,22,0.9)"     // 深酒红
                ],
            },
            // 图例的文字颜色
            textStyle: {
                color: "#000",
            },
            backgroundColor: "rgba(255,255,255,0.95)",  // **白色背景，略透明可调**
            borderColor: "#ccc",                        // **边框颜色**
            borderWidth: 1,                             // **边框宽度**
            padding: [9, 10, 9, 10],                  // **上下左右内边距，可自调**
        },

        // 设置地图底层地理坐标系的geo配置
        geo: {
            map: regionCode,  // 根据点击区域值动态变化
            roam: false,  // 不允许用户drag或zoom交互
            selectedMode: false, //是否允许选中多个区域
            center: config.center,
            zoom: config.zoom,
            top: top,
            left: left,
            // aspectScale: 0.78,
            show: true,  // 是否显示geo的地图底层
            itemStyle: {
                areaColor: 'rgba(0,0,0,0)', // 完全透明
                borderColor: 'rgba(0, 0, 0, 0)', // 边界线也可透明，随你
            },

            // 因为geo和scatter都应用在同一个图层layer，所以geo默认的效果会覆盖到scatter，如果要统一就要在geo这里添加相应scatter的修改
            // 鼠标移入或选中区域时的效果配置（高亮状态）
            emphasis: {
                disabled: true,
            },
        },
        
        series: [
            // map图层会根据regioncode渲染地图区域（包括控制交互、样式、提示框等）
            {
                name: "MAP",
                type: "map",
                map: regionCode,
                // aspectScale: 0.78,
                data: list,
                // data: [1,100],
                selectedMode: false, //是否允许选中多个区域
                zoom: zoom,
                geoIndex: 0,  // effectscatter默认0，如果这里设置1，会在不同上下层，导致坐标轴不统一会错乱打点
                top: top,
                left: left,

                // 提示框的配置
                tooltip: {   
                    show: false,
                    formatter: function (params: any) {  // 显示内容：有数据显示，没有显示名字
                        if (params.data) {
                            // return params.name + "：" + params.data["value"];
                            return params.name;
                        } else {
                            return params.name;
                        }
                    },
                    // 提示框背景、文字、边框颜色 
                    backgroundColor: "rgba(0,0,0,.6)",
                    borderColor: "rgba(147, 235, 248, .8)",
                    textStyle: {
                        color: "#FFF",
                    },
                },

                // 地图上区域名称的文本标签
                label: {
                    show: false,
                    color: "#000",
                    // position: [-10, 0],
                    formatter: function (val: any) {  // 格式化文字显示内容 北京市->北京
                        // console.log(val)
                        if (val.data !== undefined) {
                            return val.name.slice(0, 2);
                        } else {
                            return "";
                        }
                    },
                    rich: {},   // 高级文本样式配置，可是个别设置不同区域名配置
                },

                // 鼠标移入或选中区域时的效果配置（高亮状态）
                // emphasis: {
                //     label: {
                //         show: false,
                //     },
                //     // 设置高亮状态下地图区域的颜色样式
                //     itemStyle: {
                //         // areaColor: "rgba(56,155,183,.7)",
                //         areaColor:{
                //             type: "radial",  // 径向渐变，从中心向四周扩散
                //             // xy渐变中心在区域中心点，r渐变半径（占据整个图形区域的80%）
                //             x: 0.5,
                //             y: 0.5,
                //             r: 0.8,
                //             colorStops: [   // 渐变的颜色点
                //                 {
                //                     offset: 0,  // 中心颜色
                //                     color: "rgba(147, 235, 248, 0)", // 0% 处的颜色
                //                 },
                //                 {
                //                     offset: 1,  // 边缘颜色
                //                     color: "rgba(56,155,183, .8)", // 100% 处的颜色
                //                 },
                //             ],
                //             globalCoord: false, // 让每个区域独立高亮
                //         },
                //         borderWidth: 1,   // 控制区域边界线的清晰度
                //     },
                // },
            },

            // effectScatter图层会根据mapData渲染经纬度打点，显示涟漪动画
            {
                data: mapData,  // 数据结构：[经度,纬度,数据值]
                type: "effectScatter",
                coordinateSystem: "geo",   // 绘制在geo地图坐标上
                symbolSize: function (val: any) {  // 控制坐标点的大小
                    return 2;
                    // return val[2] / 50; 这个设计根据数据值来动态调整大小
                },
                legendHoverLink: true,  // 鼠标移到图例上，点会高亮
                showEffectOn: "none",  // 渲染完就出大涟漪动画
                rippleEffect: {   // 涟漪特效设置
                    // period: 4,
                    scale: 8,
                    color: "rgba(255,255,255, 1)",
                    brushType: "fill",
                },

                // 用户悬停在点上会展示对应信息
                // tooltip: {
                //     show: false,
                //     formatter: function (params: any) {
                //         if (params.data) {
                //             return params.name + "：" + params.data["value"][2];
                //         } else {
                //             return params.name;
                //         }
                //     },
                //     backgroundColor: "rgba(0,0,0,.6)",
                //     borderColor: "rgba(147, 235, 248, .8)",
                //     textStyle: {
                //         color: "#FFF",
                //     },
                // },

                // 地图上各个区域的名字（北京）样式
                label: {
                    formatter: (param: any) => {
                        return param.name.slice(0, 2);
                    },

                    fontSize: 12,
                    offset: [0, 2],
                    position: "bottom",
                    textBorderColor: "#fff",
                    textShadowColor: "#000",
                    textShadowBlur: 0,
                    textBorderWidth: 0,
                    color: "#000",
                    show: true,
                },

                // colorBy: "data",

                // 设置每个散点的样式外观
                itemStyle: {
                    color: "rgba(255,255,255,1)",
                    borderColor: "rgba(255,255,255,2)",
                    borderWidth: 4,
                    shadowColor: "#000",
                    shadowBlur: 10,
                },
            },
        ],
        //动画效果
        // animationDuration: 1000,
        // animationEasing: 'linear',
        // animationDurationUpdate: 1000
    };
}

// 文物类型（弹窗）
export const antiqueTypeList: any = [
  "建筑类", "石刻类", "青铜类", "陶器类", "玉器类", "织布类", "纸质类", "其他"
];


// 设置中国各省用以遍历区域文物分布
export const cityList = [
    "北京", "天津", "河北", "山东", "辽宁", "吉林", "黑龙江", "山西", "陕西", "河南",
    "江苏", "四川", "香港", "台湾", "福建", "上海", "浙江", "安徽", "江西", "湖南", "湖北", "重庆", "贵州",
    "内蒙古", "宁夏", "甘肃", "新疆",
    "青海", "西藏",
    "广东", "广西", "海南", "澳门","云南",
    "南海诸岛"
];

// backup
// export const cityList = [
//     "北京市", "天津市", "河北省", "山东省", "辽宁省", "吉林省", "黑龙江省", "山西省", "陕西省", "河南省",
//     "江苏省", "四川省", "香港特别行政区", "台湾省", "福建省", "上海市", "浙江省", "安徽省", "江西省", "湖南省", "湖北省", "重庆市", "贵州省",
//     "内蒙古自治区", "宁夏回族自治区", "甘肃省", "新疆维吾尔自治区",
//     "青海省", "西藏自治区",
//     "广东省", "广西壮族自治区", "海南省", "澳门特别行政区","云南省",
//     "南海诸岛"
// ];

// 区域文物分布
export const antiqueType: any = {
  "建筑类": 0,
  "石刻类": 1,
  "青铜类": 2,
  "陶器类": 3,
  "玉器类": 4,
  "织布类": 5,
  "纸质类": 6,
  "其他": 7
};

// 设置 value 映射：每种片区一个固定值
export const climateTypeToValue: any = {
  "热带雨林片区": 0,
  "温带季风片区": 1,
  "温带大陆性片区": 2,
  "高原山地片区": 3,
  "亚热带季风片区": 4,
  "热带季风片区": 5
};

// 弹窗区域选择，额外设置用于裁剪过长地名，如下片区相似是因为要对应geojson名字，不能随意更换
export const popupRegions: Record<string, string[]> = {
    "热带雨林片区": ["海南"],
    "温带季风片区": ["北京", "天津", "河北", "山东", "辽宁", "吉林", "黑龙江", "山西", "陕西", "河南"],
    "温带大陆性片区": ["内蒙古", "宁夏", "甘肃", "新疆"],
    "高原山地片区": ["青海", "西藏"],
    "亚热带季风片区": ["江苏", "四川", "台湾", "福建", "上海", "浙江", "安徽", "江西", "湖南", "湖北", "重庆", "贵州"],
    "热带季风片区": ["广东", "广西", "澳门", "云南", "香港"],
};

// 设置6个气候片区
export const climateRegions: Record<string, string[]> = {
    "热带雨林片区": ["南海诸岛", "海南省"],
    "温带季风片区": ["北京市", "天津市", "河北省", "山东省", "辽宁省", "吉林省", "黑龙江省", "山西省", "陕西省", "河南省"],
    "温带大陆性片区": ["内蒙古自治区", "宁夏回族自治区", "甘肃省", "新疆维吾尔自治区"],
    "高原山地片区": ["青海省", "西藏自治区"],
    "亚热带季风片区": ["江苏省", "四川省", "台湾省", "福建省", "上海市", "浙江省", "安徽省", "江西省", "湖南省", "湖北省", "重庆市", "贵州省"],
    "热带季风片区": ["广东省", "广西壮族自治区", "澳门特别行政区", "云南省", "香港特别行政区"],
};

// 设置各区域中的城市
export const provinceCities: Record<string, string[]> = {
//   '北京': ['北京'],
//   '天津': ['天津'],
//   '上海': ['上海'],
//   '重庆': ['重庆'],
  '河北': ['石家庄市','唐山市','秦皇岛市','邯郸市','邢台市','保定市','张家口市','承德市','沧州市','廊坊市','衡水市'],
  '山西': ['太原市','大同市','阳泉市','长治市','晋城市','朔州市','晋中市','运城市','忻州市','临汾市','吕梁市'],
  '辽宁': ['沈阳市','大连市','鞍山市','抚顺市','本溪市','丹东市','锦州市','营口市','阜新市','辽阳市','盘锦市','铁岭市','朝阳市','葫芦岛市'],
  '吉林': ['长春市','吉林市','四平市','辽源市','通化市','白山市','松原市','白城市','延边朝鲜族自治州'],
  '黑龙': ['哈尔滨市','齐齐哈尔市','鸡西市','鹤岗市','双鸭山市','大庆市','伊春市','佳木斯市','七台河市','牡丹江市','黑河市','绥化市','大兴安岭地区'],
  '江苏': ['南京市','无锡市','徐州市','常州市','苏州市','南通市','连云港市','淮安市','盐城市','扬州市','镇江市','泰州市','宿迁市'],
  '浙江': ['杭州市','宁波市','温州市','嘉兴市','湖州市','绍兴市','金华市','衢州市','舟山市','台州市','丽水市'],
  '安徽': ['合肥市','芜湖市','蚌埠市','淮南市','马鞍山市','淮北市','铜陵市','安庆市','黄山市','滁州市','阜阳市','宿州市','六安市','亳州市','池州市','宣城市'],
  '福建': ['福州市','厦门市','莆田市','三明市','泉州市','漳州市','南平市','龙岩市','宁德市'],
  '江西': ['南昌市','景德镇市','萍乡市','九江市','新余市','鹰潭市','赣州市','吉安市','宜春市','抚州市','上饶市'],
  '山东': ['济南市','青岛市','淄博市','枣庄市','东营市','烟台市','潍坊市','济宁市','泰安市','威海市','日照市','临沂市','德州市','聊城市','滨州市','菏泽市'],
  '河南': ['郑州市','开封市','洛阳市','平顶山市','安阳市','鹤壁市','新乡市','焦作市','濮阳市','许昌市','漯河市','三门峡市','南阳市','商丘市','信阳市','周口市','驻马店市','济源市'],
  '湖北': ['武汉市','黄石市','十堰市','宜昌市','襄阳市','鄂州市','荆门市','孝感市','荆州市','黄冈市','咸宁市','随州市','恩施土家族苗族自治州', '仙桃市', '潜江市', '天门市', '神农架林区'],
  '湖南': ['长沙市','株洲市','湘潭市','衡阳市','邵阳市','岳阳市','常德市','张家界市','益阳市','郴州市','永州市','怀化市','娄底市','湘西土家族苗族自治州'],
  '广东': ['广州市','韶关市','深圳市','珠海市','汕头市','佛山市','江门市','湛江市','茂名市','肇庆市','惠州市','梅州市','汕尾市','河源市','阳江市','清远市','东莞市','中山市','潮州市','揭阳市','云浮市'],
  '广西': ['南宁市','柳州市','桂林市','梧州市','北海市','防城港市','钦州市','贵港市','玉林市','百色市','贺州市','河池市','来宾市','崇左市'],
  '海南': ['海口市','三亚市','三沙市','儋州市', '五指山市', '琼海市', '文昌市', '万宁市', '东方市', '定安县', '屯昌县', '澄迈县', '临高县', '白沙黎族自治县', '昌江黎族自治县', '乐东黎族自治县', '陵水黎族自治县', '保亭黎族苗族自治县', '琼中黎族苗族自治县'],
  '四川': ['成都市','自贡市','攀枝花市','泸州市','德阳市','绵阳市','广元市','遂宁市','内江市','乐山市','南充市','眉山市','宜宾市','广安市','达州市','雅安市','巴中市','资阳市','阿坝藏族羌族自治州','甘孜藏族自治州','凉山彝族自治州'],
  '贵州': ['贵阳市','六盘水市','遵义市','安顺市','毕节市','铜仁市','黔西南布依族苗族自治州','黔东南苗族侗族自治州','黔南布依族苗族自治州'],
  '云南': ['昆明市','曲靖市','玉溪市','保山市','昭通市','丽江市','普洱市','临沧市','楚雄彝族自治州','红河哈尼族彝族自治州','文山壮族苗族自治州','西双版纳傣族自治州','大理白族自治州','德宏傣族景颇族自治州','怒江傈僳族自治州','迪庆藏族自治州'],
  '西藏': ['拉萨市','日喀则市','昌都市','林芝市','山南市','那曲市','阿里地区'],
  '陕西': ['西安市','铜川市','宝鸡市','咸阳市','渭南市','延安市','汉中市','榆林市','安康市','商洛市'],
  '甘肃': ['兰州市','嘉峪关市','金昌市','白银市','天水市','武威市','张掖市','平凉市','酒泉市','庆阳市','定西市','陇南市','临夏回族自治州','甘南藏族自治州'],
  '青海': ['西宁市','海东市','海北藏族自治州','黄南藏族自治州','海南藏族自治州','果洛藏族自治州','玉树藏族自治州','海西蒙古族藏族自治州'],
  '宁夏': ['银川市','石嘴山市','吴忠市','固原市','中卫市'],
  '新疆': ['乌鲁木齐市','克拉玛依市','吐鲁番市','哈密市','昌吉回族自治州','博尔塔拉蒙古自治州','巴音郭楞蒙古自治州','阿克苏地区','克孜勒苏柯尔克孜自治州','喀什地区','和田地区','伊犁哈萨克自治州','塔城地区','阿勒泰地区','石河子市','阿拉尔市','图木舒克市','五家渠市','北屯市','铁门关市','双河市','可克达拉市','昆玉市','胡杨河市'],
//   '香港': ['香港'],
//   '澳门': ['澳门'],
//   '南海':['南海'],
  '内蒙': ['呼和浩特市', '包头市', '乌海市', '赤峰市', '通辽市', '鄂尔多斯市', '呼伦贝尔市', '巴彦淖尔市', '乌兰察布市', '兴安盟', '锡林郭勒盟', '阿拉善盟'],
//   '台湾': ['台湾']
};

export const regionCodes: any = {
    "中国": {
        "adcode": "100000",
        "level": "country",
        "name": "中华人民共和国"
    },
    "新疆维吾尔自治区": {
        "adcode": "650000",
        "level": "province",
        "name": "新疆维吾尔自治区"
    },
    "湖北省": {
        "adcode": "420000",
        "level": "province",
        "name": "湖北省"
    },
    "辽宁省": {
        "adcode": "210000",
        "level": "province",
        "name": "辽宁省"
    },
    "广东省": {
        "adcode": "440000",
        "level": "province",
        "name": "广东省"
    },
    "内蒙古自治区": {
        "adcode": "150000",
        "level": "province",
        "name": "内蒙古自治区"
    },
    "黑龙江省": {
        "adcode": "230000",
        "level": "province",
        "name": "黑龙江省"
    },
    "河南省": {
        "adcode": "410000",
        "level": "province",
        "name": "河南省"
    },
    "山东省": {
        "adcode": "370000",
        "level": "province",
        "name": "山东省"
    },
    "陕西省": {
        "adcode": "610000",
        "level": "province",
        "name": "陕西省"
    },
    "贵州省": {
        "adcode": "520000",
        "level": "province",
        "name": "贵州省"
    },
    "上海市": {
        "adcode": "310000",
        "level": "province",
        "name": "上海市"
    },
    "重庆市": {
        "adcode": "500000",
        "level": "province",
        "name": "重庆市"
    },
    "西藏自治区": {
        "adcode": "540000",
        "level": "province",
        "name": "西藏自治区"
    },
    "安徽省": {
        "adcode": "340000",
        "level": "province",
        "name": "安徽省"
    },
    "福建省": {
        "adcode": "350000",
        "level": "province",
        "name": "福建省"
    },
    "湖南省": {
        "adcode": "430000",
        "level": "province",
        "name": "湖南省"
    },
    "海南省": {
        "adcode": "460000",
        "level": "province",
        "name": "海南省"
    },
    "江苏省": {
        "adcode": "320000",
        "level": "province",
        "name": "江苏省"
    },
    "青海省": {
        "adcode": "630000",
        "level": "province",
        "name": "青海省"
    },
    "广西壮族自治区": {
        "adcode": "450000",
        "level": "province",
        "name": "广西壮族自治区"
    },
    "宁夏回族自治区": {
        "adcode": "640000",
        "level": "province",
        "name": "宁夏回族自治区"
    },
    "浙江省": {
        "adcode": "330000",
        "level": "province",
        "name": "浙江省"
    },
    "河北省": {
        "adcode": "130000",
        "level": "province",
        "name": "河北省"
    },
    "香港特别行政区": {
        "adcode": "810000",
        "level": "province",
        "name": "香港特别行政区"
    },
    "台湾省": {
        "adcode": "710000",
        "level": "province",
        "name": "台湾省"
    },
    "澳门特别行政区": {
        "adcode": "820000",
        "level": "province",
        "name": "澳门特别行政区"
    },
    "甘肃省": {
        "adcode": "620000",
        "level": "province",
        "name": "甘肃省"
    },
    "四川省": {
        "adcode": "510000",
        "level": "province",
        "name": "四川省"
    },
    "天津市": {
        "adcode": "120000",
        "level": "province",
        "name": "天津市"
    },
    "江西省": {
        "adcode": "360000",
        "level": "province",
        "name": "江西省"
    },
    "云南省": {
        "adcode": "530000",
        "level": "province",
        "name": "云南省"
    },
    "山西省": {
        "adcode": "140000",
        "level": "province",
        "name": "山西省"
    },
    "北京市": {
        "adcode": "110000",
        "level": "province",
        "name": "北京市"
    },
    "吉林省": {
        "adcode": "220000",
        "level": "province",
        "name": "吉林省"
    },
    "南海诸岛": {
        "adcode": "chinaNanhai",
        "level": "province",
        "name": "南海诸岛"
    }
}